Tekla Open API Reference for Tekla Structures 2025
AnalysisDecomposedLoad.AnalysisLoadType Property
 Gets or sets the type of the analysis decomposed load.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisDecomposedLoad.AnalysisLoadTypeEnum AnalysisLoadType { get; set; }
Public Property AnalysisLoadType As AnalysisDecomposedLoad.AnalysisLoadTypeEnum
	Get
	Set
Property Value
Type: AnalysisDecomposedLoad.AnalysisLoadTypeEnum
See Also
Reference
AnalysisDecomposedLoad Class
Tekla.Structures.Analysis Namespace